app/Models/AttendanceModel.php

    public function getAttendanceBySubject(?int $userId = null, bool $isAdmin = false): array
{
    if (!$isAdmin) {
        log_message('info', 'Fetching attendance for lecturer ID: ' . $userId);

        $query = $this->select('courses.course_name, classes.subject_code,classes.random_code, attendance.class_id, COUNT(attendance.attendance_id) as total')
            ->join('classes', 'classes.class_id = attendance.class_id') // Join classes with attendance
            ->join('courses', 'courses.course_code = classes.subject_code') // Join courses with classes
            ->where('classes.user_id', $userId) // Filter by lecturer ID
            ->groupBy('courses.course_name, classes.subject_code, attendance.class_id') // Group by class_id
            ->orderBy('classes.subject_code', 'ASC')
            ->findAll();

        log_message('info', 'Lecturer Attendance Query Result: ' . json_encode($query)); // Log result

        return $query;
    }


    $query = $this->select('courses.course_name, classes.subject_code,classes.random_code, attendance.class_id, COUNT(attendance.attendance_id) as total')
    ->join('classes', 'classes.class_id = attendance.class_id') // Join classes with attendance
    ->join('courses', 'courses.course_code = classes.subject_code') // Join courses with classes
    ->groupBy('courses.course_name, classes.subject_code, attendance.class_id')
    ->orderBy('classes.subject_code', 'ASC')
    ->findAll();
---
SELECT `courses`.`course_name`, `classes`.`subject_code`, `classes`.`random_code`, `attendance`.`class_id`, COUNT(attendance.attendance_id) as total
FROM `attendance`
JOIN `classes` ON `classes`.`class_id` = `attendance`.`class_id`
JOIN `courses` ON `courses`.`course_code` = `classes`.`subject_code`
WHERE `classes`.`user_id` = 23
GROUP BY `courses`.`course_name`, `classes`.`subject_code`, `attendance`.`class_id`
ORDER BY `classes`.`subject_code` ASC
SELECT `courses`.`course_name`, `classes`.`subject_code`, `classes`.`random_code`, `attendance`.`class_id`, COUNT(attendance.attendance_id) as total
FROM `attendance`
JOIN `classes` ON `classes`.`class_id` = `attendance`.`class_id`
JOIN `courses` ON `courses`.`course_code` = `classes`.`subject_code`
GROUP BY `courses`.`course_name`, `classes`.`subject_code`, `attendance`.`class_id`
ORDER BY `classes`.`subject_code` ASC