app/Models/PermissionModel.php

SELECT `permission`.`permission_name`
FROM `role_permission`
INNER JOIN `permission` ON `permission`.`permission_id` = `role_permission`.`permission_id`
WHERE `role_permission`.`role_id` = '65'
---
    public function getPermissionsByRole($roleId)
{
    $result = $this->db->table('role_permission')
                       ->select('permission.permission_name')
                       ->join('permission', 'permission.permission_id = role_permission.permission_id', 'inner')
                       ->where('role_permission.role_id', $roleId)
                       ->get()
                       ->getResultArray();